1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

Задача:

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:

[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmаrk”, “Kazan”] → []

Решение:

1. Создать репозиторий на GitHub
2. Создать блок-схему
3. Создадим массив

```
string[] input = {'yard', 'hello', 'dom', 'abc', '38'};
```

И массив для хранения данных в соответствии с условием

```
string[] result = new string[input.Length];
```

4. Напишем цикл для заполнения нового массива

```
for (int i = 0; i < input.Length; i++)
{
    if (input[i].Length <= maxLength)
    {
        result[i] = input[i];
    }
}
```

5. Выведем результат

```
foreach (string resultItem in result)
{
    Console.WriteLine(resultItem);
}
```

6. Используем команду в git, чтобы сохранить изменения в GitHub

```
git push
```
